Model input shape (110, 30)
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
simple_rnn_1 (SimpleRNN)     (None, 110, 2)            66        
_________________________________________________________________
dropout_1 (Dropout)          (None, 110, 2)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 110, 2)            6         
_________________________________________________________________
flatten_1 (Flatten)          (None, 220)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 442       
=================================================================
Total params: 514
Trainable params: 514
Non-trainable params: 0
_________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 90s 60ms/step - loss: 0.5484 - accuracy: 0.7602 - val_loss: 0.2757 - val_accuracy: 0.9290
Saved model to disk
>#1 test accuracy: 94.325
Model input shape (110, 30)
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
simple_rnn_2 (SimpleRNN)     (None, 110, 2)            66        
_________________________________________________________________
dropout_2 (Dropout)          (None, 110, 2)            0         
_________________________________________________________________
dense_3 (Dense)              (None, 110, 2)            6         
_________________________________________________________________
flatten_2 (Flatten)          (None, 220)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 442       
=================================================================
Total params: 514
Trainable params: 514
Non-trainable params: 0
_________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 89s 59ms/step - loss: 0.3008 - accuracy: 0.8692 - val_loss: 0.0575 - val_accuracy: 0.9826
Saved model to disk
>#2 test accuracy: 97.987
Model input shape (110, 30)
Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
simple_rnn_3 (SimpleRNN)     (None, 110, 2)            66        
_________________________________________________________________
dropout_3 (Dropout)          (None, 110, 2)            0         
_________________________________________________________________
dense_5 (Dense)              (None, 110, 2)            6         
_________________________________________________________________
flatten_3 (Flatten)          (None, 220)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 442       
=================================================================
Total params: 514
Trainable params: 514
Non-trainable params: 0
_________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 85s 56ms/step - loss: 0.6877 - accuracy: 0.7232 - val_loss: 0.3260 - val_accuracy: 0.8928
Saved model to disk
>#3 test accuracy: 89.546
Model input shape (110, 30)
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
simple_rnn_4 (SimpleRNN)     (None, 110, 2)            66        
_________________________________________________________________
dropout_4 (Dropout)          (None, 110, 2)            0         
_________________________________________________________________
dense_7 (Dense)              (None, 110, 2)            6         
_________________________________________________________________
flatten_4 (Flatten)          (None, 220)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 442       
=================================================================
Total params: 514
Trainable params: 514
Non-trainable params: 0
_________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 84s 55ms/step - loss: 0.5054 - accuracy: 0.7966 - val_loss: 0.2310 - val_accuracy: 0.8941
Saved model to disk
>#4 test accuracy: 90.476
Model input shape (110, 30)
Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
simple_rnn_5 (SimpleRNN)     (None, 110, 2)            66        
_________________________________________________________________
dropout_5 (Dropout)          (None, 110, 2)            0         
_________________________________________________________________
dense_9 (Dense)              (None, 110, 2)            6         
_________________________________________________________________
flatten_5 (Flatten)          (None, 220)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 2)                 442       
=================================================================
Total params: 514
Trainable params: 514
Non-trainable params: 0
_________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 84s 55ms/step - loss: 0.3551 - accuracy: 0.8593 - val_loss: 0.0364 - val_accuracy: 1.0000
Saved model to disk
>#5 test accuracy: 100.000
[94.32522058486938, 97.98672795295715, 89.54645991325378, 90.47566652297974, 100.0]
Test accuracy: 94.467% (+/-4.078)
CPU times: user 22min 23s, sys: 3min 11s, total: 25min 35s
Wall time: 13min 4s
