{"class_name": "Model", "config": {"name": "model_110", "layers": [{"name": "input_283", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_283"}, "inbound_nodes": []}, {"name": "input_285", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_285"}, "inbound_nodes": []}, {"name": "input_284", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_284"}, "inbound_nodes": []}, {"name": "input_286", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_286"}, "inbound_nodes": []}, {"name": "input_287", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_287"}, "inbound_nodes": []}, {"name": "r_arm_layer", "class_name": "SimpleRNN", "config": {"name": "r_arm_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_283", 0, 0, {}]]]}, {"name": "trunk_layer", "class_name": "SimpleRNN", "config": {"name": "trunk_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_285", 0, 0, {}]]]}, {"name": "l_arm_layer", "class_name": "SimpleRNN", "config": {"name": "l_arm_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_284", 0, 0, {}]]]}, {"name": "r_leg_layer", "class_name": "SimpleRNN", "config": {"name": "r_leg_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_286", 0, 0, {}]]]}, {"name": "l_leg_layer", "class_name": "SimpleRNN", "config": {"name": "l_leg_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_287", 0, 0, {}]]]}, {"name": "r_arm_trunk_layer", "class_name": "Concatenate", "config": {"name": "r_arm_trunk_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["r_arm_layer", 0, 0, {}], ["trunk_layer", 0, 0, {}]]]}, {"name": "l_arm_trunk_layer", "class_name": "Concatenate", "config": {"name": "l_arm_trunk_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["l_arm_layer", 0, 0, {}], ["trunk_layer", 0, 0, {}]]]}, {"name": "r_leg_trunk_layer", "class_name": "Concatenate", "config": {"name": "r_leg_trunk_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["r_leg_layer", 0, 0, {}], ["trunk_layer", 0, 0, {}]]]}, {"name": "l_leg_trunk_layer", "class_name": "Concatenate", "config": {"name": "l_leg_trunk_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["l_leg_layer", 0, 0, {}], ["trunk_layer", 0, 0, {}]]]}, {"name": "upper_body_layer", "class_name": "Concatenate", "config": {"name": "upper_body_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["r_arm_trunk_layer", 0, 0, {}], ["l_arm_trunk_layer", 0, 0, {}]]]}, {"name": "lower_body_layer", "class_name": "Concatenate", "config": {"name": "lower_body_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["r_leg_trunk_layer", 0, 0, {}], ["l_leg_trunk_layer", 0, 0, {}]]]}, {"name": "full_body_layer", "class_name": "Concatenate", "config": {"name": "full_body_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["upper_body_layer", 0, 0, {}], ["lower_body_layer", 0, 0, {}]]]}, {"name": "dropout_73", "class_name": "Dropout", "config": {"name": "dropout_73", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["full_body_layer", 0, 0, {}]]]}, {"name": "relu_layer", "class_name": "Dense", "config": {"name": "relu_layer", "trainable": true, "dtype": "float32", "units": 2, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_73", 0, 0, {}]]]}, {"name": "flatten_79", "class_name": "Flatten", "config": {"name": "flatten_79", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["relu_layer", 0, 0, {}]]]}, {"name": "softmax_layer", "class_name": "Dense", "config": {"name": "softmax_layer", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_79", 0, 0, {}]]]}], "input_layers": [["input_283", 0, 0], ["input_284", 0, 0], ["input_285", 0, 0], ["input_286", 0, 0], ["input_287", 0, 0]], "output_layers": [["softmax_layer", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}