{"class_name": "Model", "config": {"name": "model_106", "layers": [{"name": "input_263", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_263"}, "inbound_nodes": []}, {"name": "input_265", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_265"}, "inbound_nodes": []}, {"name": "input_264", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_264"}, "inbound_nodes": []}, {"name": "input_266", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_266"}, "inbound_nodes": []}, {"name": "input_267", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 6], "dtype": "float32", "sparse": false, "name": "input_267"}, "inbound_nodes": []}, {"name": "r_arm_layer", "class_name": "SimpleRNN", "config": {"name": "r_arm_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_263", 0, 0, {}]]]}, {"name": "trunk_layer", "class_name": "SimpleRNN", "config": {"name": "trunk_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_265", 0, 0, {}]]]}, {"name": "l_arm_layer", "class_name": "SimpleRNN", "config": {"name": "l_arm_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_264", 0, 0, {}]]]}, {"name": "r_leg_layer", "class_name": "SimpleRNN", "config": {"name": "r_leg_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_266", 0, 0, {}]]]}, {"name": "l_leg_layer", "class_name": "SimpleRNN", "config": {"name": "l_leg_layer", "trainable": true, "batch_input_shape": [null, 110, 6], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["input_267", 0, 0, {}]]]}, {"name": "r_arm_trunk_layer", "class_name": "Concatenate", "config": {"name": "r_arm_trunk_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["r_arm_layer", 0, 0, {}], ["trunk_layer", 0, 0, {}]]]}, {"name": "l_arm_trunk_layer", "class_name": "Concatenate", "config": {"name": "l_arm_trunk_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["l_arm_layer", 0, 0, {}], ["trunk_layer", 0, 0, {}]]]}, {"name": "r_leg_trunk_layer", "class_name": "Concatenate", "config": {"name": "r_leg_trunk_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["r_leg_layer", 0, 0, {}], ["trunk_layer", 0, 0, {}]]]}, {"name": "l_leg_trunk_layer", "class_name": "Concatenate", "config": {"name": "l_leg_trunk_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["l_leg_layer", 0, 0, {}], ["trunk_layer", 0, 0, {}]]]}, {"name": "upper_body_layer", "class_name": "Concatenate", "config": {"name": "upper_body_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["r_arm_trunk_layer", 0, 0, {}], ["l_arm_trunk_layer", 0, 0, {}]]]}, {"name": "lower_body_layer", "class_name": "Concatenate", "config": {"name": "lower_body_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["r_leg_trunk_layer", 0, 0, {}], ["l_leg_trunk_layer", 0, 0, {}]]]}, {"name": "full_body_layer", "class_name": "Concatenate", "config": {"name": "full_body_layer", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["upper_body_layer", 0, 0, {}], ["lower_body_layer", 0, 0, {}]]]}, {"name": "dropout_69", "class_name": "Dropout", "config": {"name": "dropout_69", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["full_body_layer", 0, 0, {}]]]}, {"name": "relu_layer", "class_name": "Dense", "config": {"name": "relu_layer", "trainable": true, "dtype": "float32", "units": 2, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_69", 0, 0, {}]]]}, {"name": "flatten_75", "class_name": "Flatten", "config": {"name": "flatten_75", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["relu_layer", 0, 0, {}]]]}, {"name": "softmax_layer", "class_name": "Dense", "config": {"name": "softmax_layer", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_75", 0, 0, {}]]]}], "input_layers": [["input_263", 0, 0], ["input_264", 0, 0], ["input_265", 0, 0], ["input_266", 0, 0], ["input_267", 0, 0]], "output_layers": [["softmax_layer", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}