Model input shape (110, 6)
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_1[0][0]                    
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_3[0][0]                    
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_2[0][0]                    
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_4[0][0]                    
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_5[0][0]                    
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_1[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_1[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 355s 235ms/step - loss: 0.0538 - accuracy: 0.9828 - val_loss: 0.0017 - val_accuracy: 1.0000
Saved model to disk
>#1 validation accuracy: 100.000
Model input shape (110, 6)
Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_8 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_7 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_9 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_10 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_6[0][0]                    
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_8[0][0]                    
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_7[0][0]                    
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_9[0][0]                    
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_10[0][0]                   
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_2[0][0]                  
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_2[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 364s 241ms/step - loss: 0.1431 - accuracy: 0.9359 - val_loss: 0.0018 - val_accuracy: 1.0000
Saved model to disk
>#2 validation accuracy: 100.000
Model input shape (110, 6)
Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_11 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_13 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_12 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_14 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_15 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_11[0][0]                   
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_13[0][0]                   
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_12[0][0]                   
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_14[0][0]                   
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_15[0][0]                   
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_3[0][0]                  
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_3[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 366s 242ms/step - loss: 0.1341 - accuracy: 0.9544 - val_loss: 0.0107 - val_accuracy: 0.9920
Saved model to disk
>#3 validation accuracy: 99.546
Model input shape (110, 6)
Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_16 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_18 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_17 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_19 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_20 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_16[0][0]                   
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_18[0][0]                   
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_17[0][0]                   
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_19[0][0]                   
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_20[0][0]                   
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_4[0][0]                  
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_4[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 350s 231ms/step - loss: 0.1029 - accuracy: 0.9590 - val_loss: 4.1647e-04 - val_accuracy: 1.0000
Saved model to disk
>#4 validation accuracy: 100.000
Model input shape (110, 6)
Model: "model_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_21 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_23 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_22 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_24 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_25 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_21[0][0]                   
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_23[0][0]                   
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_22[0][0]                   
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_24[0][0]                   
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_25[0][0]                   
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_5[0][0]                  
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_5[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 1514 samples, validate on 746 samples
Epoch 1/1
1514/1514 [==============================] - 357s 236ms/step - loss: 0.1709 - accuracy: 0.9227 - val_loss: 0.0015 - val_accuracy: 1.0000
Saved model to disk
>#5 validation accuracy: 100.000
[100.0, 100.0, 99.54646229743958, 100.0, 100.0]
Accuracy: 99.909% (+/-0.181)
CPU times: user 1h 55min 28s, sys: 25min 30s, total: 2h 20min 59s
Wall time: 1h 1min 38s
